/*
    배열 회전

    숫자를 요소로 가진 배열 belt과 숫자 sec가 주어집니다.
    belt는 무한히 회전하는 컨베이어 벨트입니다.
    해당 belt 위에는 숫자들이 올라가 있으며 숫자들은 1초마다 한칸씩 오른쪽으로 이동합니다.

    예를 들어, belt가 [1, 2, 3, 4]라면
    1초 뒤 => [4, 1, 2, 3]
    2초 뒤 => [3, 4, 1, 2]

    belt의 요소들이 sec초 동안 이동한 후의 배열을 리턴해주세요.

    입출력 예시
    ------------------------------
    input
    ------------------------------
    case1:
        rotateArray([1, 2, 3, 4, 5, 6, 7], 3)

    case2:
        rotateArray([5, 6, -2, 3, -9, 1, -8], 12)

    ------------------------------
    output
    ------------------------------
    case1:
        [5, 6, 7, 1, 2, 3, 4]

    case2:
        [-2, 3, -9, 1, -8, 5, 6]
*/

function rotateArray(belt, sec) {
  // 여기에서 작업하세요.
}

module.exports = rotateArray;
