/*
    세 수 정렬
    
    숫자 세 개가 담겨있는 배열 arr이 주어졌을 때, 
    가장 작은 수, 그 다음 수, 가장 큰 수로 오름차순 정렬한 배열을 리턴하세요.
    단) 배열에 담긴 숫자는 1보다 크거나 같고, 1,000,000보다 작거나 같다. 이 숫자는 모두 다르다.

    - (1 <= arr[i] <= 1,000,000)
    - arr의 요소 중 중복 요소는 존재하지 않습니다.

    입출력 예시
    ------------------------------
    input
    ------------------------------

    case1:
      sortNum([ 2, 3, 1 ])

    case2:
      sortNum([ 400, 501, 23 ])

    ------------------------------
    output
    ------------------------------

    case1:
      [ 1, 2, 3 ]

    case2:
      [ 23, 400, 501 ]
*/

function sortNum(arr) {
  // 여기에서 작업하세요.
}

module.exports = sortNum;
